# 01 Import Data and Libraries

In [1]:
#import libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
path = r'/Users/melaniehouston/Library/CloudStorage/OneDrive-Personal/Career Foundry/ 04 2024 Instacart Basket Analysis'

In [3]:
path

'/Users/melaniehouston/Library/CloudStorage/OneDrive-Personal/Career Foundry/ 04 2024 Instacart Basket Analysis'

In [4]:
#import customers df from Original Data
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [6]:
customers.shape

(206209, 10)

In [7]:
#descriptive statistics
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [8]:
#data types
customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

# Wrangle data to follow consistent logic

In [10]:
#rename columns to have a consistent format
customers.rename(columns = {'First Name' : 'First_name'}, inplace = True)

In [11]:
customers.rename(columns = {'Surnam' : 'Surname'}, inplace = True)

In [12]:
customers.rename(columns = {'STATE' : 'State'}, inplace = True)

In [13]:
customers.rename(columns = {'n_dependants' : 'Num_deps'}, inplace = True)

In [14]:
customers.rename(columns = {'fam_status' : 'Marital_status'}, inplace = True)

In [16]:
customers.rename(columns = {'date_joined' : 'Date_joined'}, inplace = True)

In [17]:
#let's look at new names of columns
customers.head()

,user_id,First_name,Surname,Gender,State,Age,Date_joined,Num_deps,Marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

# Complete the fundamental data quality and consistency checks

In [19]:
#check for any mixed data types in the customers df
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print(col)

First_name

In [20]:
# it looks like there's a mixed data type for the First_name column, let's make sure it all reads as a string
customers['First_name'] = customers['First_name'].astype('str')

In [21]:
#the user_id column is not an integer, it shows it is listed as such in line 8, let's fix this to also be a string/object
customers['user_id'] = customers['user_id'].astype('str')

In [22]:
#check to see if they are properly listed now
customers.dtypes

user_id           object
First_name        object
Surname           object
Gender            object
State             object
Age                int64
Date_joined       object
Num_deps           int64
Marital_status    object
income             int64
dtype: object

In [23]:
#checking to make sure nothing returns as a mixed data type
#check for any mixed data types in the customers df
for col in customers.columns.tolist():
    weird = (customers[[col]].map(type) != customers[[col]].iloc[0].apply(type)).any(axis = 1)
    if len (customers[weird]) > 0:
        print(col)

In [24]:
#check for missing values
customers.isnull().sum()

user_id           0
First_name        0
Surname           0
Gender            0
State             0
Age               0
Date_joined       0
Num_deps          0
Marital_status    0
income            0
dtype: int64

In [25]:
#looks like there are no missing values, let's check for duplicates
customers_dups = customers[customers.duplicated()]

In [26]:
customers_dups

Empty DataFrame
Columns: [user_id, First_name, Surname, Gender, State, Age, Date_joined, Num_deps, Marital_status, income]
Index: []

# Combine customers df with rest of prepared Instacart data

In [27]:
#import aggregated set of Instacart data (from 4.8)
orders_products = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'aggregated_ords_prods_merge.pkl'))

In [28]:
#check the shape of the newly imported file
orders_products.shape

(32404859, 25)

In [29]:
#check the shape of customers dataframe
customers.shape

(206209, 10)

In [30]:
#find a common column between the two sets by looking at the first 5 rows of both, first the orders_products df
orders_products.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,orders_time_of_day,...,busiest_days,slowest_days,"(busiest_days, slowest_days)",busiest_period_of_day,max_order,loyalty_flag,average_spend,spender_flag,customer_frequency,frequency_flag
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Regularly busy,Regularly busy,Regularly busy,Most orders,32,Regular customer,6.935811,low_spender,8.000000,Frequent customer
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Regularly busy,Regularly busy,Regularly busy,Average orders,32,Regular customer,6.935811,low_spender,8.000000,Frequent customer
2,1,Chocolate Sandwich Cookies,61,19,5.8,389851,709,2,0,21,...,Busiest day,Busiest day,Busiest day,Average orders,5,New customer,7.930208,low_spender,8.000000,Frequent customer
3,1,Chocolate Sandwich Cookies,61,19,5.8,652770,764,1,3,13,...,Regularly busy,Regularly busy,Regularly busy,Most orders,3,New customer,4.972414,low_spender,11.114836,Regular customer
4,1,Chocolate Sandwich Cookies,61,19,5.8,1813452,764,3,4,17,...,Least busy,Least busy,Least busy,Average orders,3,New customer,4.972414,low_spender,11.114836,Regular customer

In [31]:
#then the customers df...

In [32]:
customers.head()

,user_id,First_name,Surname,Gender,State,Age,Date_joined,Num_deps,Marital_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [33]:
#both dataframes have a user_id column, we'll need this one as a key to merge them together, 
#but first to check if the user_id column has the same data type in both df!
#the customers user_id is an object/string (as above), what about the orders_products user_id...
orders_products.dtypes

product_id                         int64
product_name                      object
aisle_id                           int64
department_id                      int64
prices                           float64
order_id                           int64
user_id                            int64
order_number                       int64
orders_day_of_week                 int64
orders_time_of_day                 int64
days_since_prior_order           float64
add_to_cart_order                  int64
reordered                          int64
_merge                          category
price_range_loc                   object
busiest_days                      object
slowest_days                      object
(busiest_days, slowest_days)      object
busiest_period_of_day             object
max_order                          int64
loyalty_flag                      object
average_spend                    float64
spender_flag                      object
customer_frequency               float64
frequency_flag                    object
dtype: object

In [34]:
#ahhhh it is an integer and this could cause issues, let's fix it so they're both the same
orders_products['user_id'] = orders_products['user_id'].astype('str')

In [35]:
#did it work? Let's check the user_id...
orders_products.dtypes

product_id                         int64
product_name                      object
aisle_id                           int64
department_id                      int64
prices                           float64
order_id                           int64
user_id                           object
order_number                       int64
orders_day_of_week                 int64
orders_time_of_day                 int64
days_since_prior_order           float64
add_to_cart_order                  int64
reordered                          int64
_merge                          category
price_range_loc                   object
busiest_days                      object
slowest_days                      object
(busiest_days, slowest_days)      object
busiest_period_of_day             object
max_order                          int64
loyalty_flag                      object
average_spend                    float64
spender_flag                      object
customer_frequency               float64
frequency_flag                    object
dtype: object

In [38]:
#success! Drop the existing _merge column from previous exercises
orders_products = orders_products.drop(columns=['_merge'])

In [39]:
#Now we merge the two dataframes with the same datatype user_id column as the shared column with the default inner join
customer_ords_prods = orders_products.merge(customers, on = 'user_id', indicator = True)

In [40]:
#Check the frame of the newly made data frame, customer_ords_prods
customer_ords_prods.shape

(32404859, 34)

In [41]:
#yes! 34 columns now and all the rows! Let's look at all the columns together...
customer_ords_prods.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,orders_time_of_day,...,First_name,Surname,Gender,State,Age,Date_joined,Num_deps,Marital_status,income,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620,both

In [42]:
#check datatypes
customer_ords_prods.dtypes

product_id                         int64
product_name                      object
aisle_id                           int64
department_id                      int64
prices                           float64
order_id                           int64
user_id                           object
order_number                       int64
orders_day_of_week                 int64
orders_time_of_day                 int64
days_since_prior_order           float64
add_to_cart_order                  int64
reordered                          int64
price_range_loc                   object
busiest_days                      object
slowest_days                      object
(busiest_days, slowest_days)      object
busiest_period_of_day             object
max_order                          int64
loyalty_flag                      object
average_spend                    float64
spender_flag                      object
customer_frequency               float64
frequency_flag                    object
First_name                        object
Surname                           object
Gender                            object
State                             object
Age                                int64
Date_joined                       object
Num_deps                           int64
Marital_status                    object
income                             int64
_merge                          category
dtype: object

In [43]:
#lets fix the order_id to also be a string/object just like the user_id is 
customer_ords_prods['order_id'] = customer_ords_prods['order_id'].astype('str')

In [45]:
#verify
customer_ords_prods.dtypes['order_id']

dtype('O')

# Export this new dataframe as a pickle file so you can continue to use it in the second part of this task.

In [47]:
customer_ords_prods.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_customers_merged.pkl'))